import random

print("欢迎来到我问你答小游戏")
x = input("请问你的名字是：")
print("哈喽，" + x + "请发动你聪明的的小机灵，展现实力的时候到喽！")
print('游戏规则：一共5个关卡，成功回答5个问题即获得"机智王"称号,一但答错便失败')
i = 0
y = 0
flg = 1
dit = {
    "你吃饭了吗？": ["是", "否", "吃", "Good,恭喜你答对了"],
    "天气热不热，现在？": ["热", "不热", "还好", "我", "还行", "哇哦！真不错"],
    "游乐王子说过的一句很火的话是什么？": ["雨你无瓜", "不错哦！继续吧~"],
    "锄禾日当午的下一句？": ["汗滴禾下土", "真是个小机灵鬼，明白其中的玄机了吗？"],
    "你喜欢吃面食还是饭食？": ["面", "饭", "食", "喜欢", "不", "成功进入下一关"]
}
j = random.sample(dit.keys(), 5)
while i < 5:
    a = j[i]
    print("第%d关" % (i + 1))
    print(a)
    daan = input("请输入你的答案：")
    value = len(dit[a]) - 1  # 得到每一个问题的答案个数
    y = 0
    while y < value:
        if dit[a][y] in daan:  # 检测用户输入的答案里面是否包含相关的关键词，如果包含则跳出程序
            i = 10  # 设定i=10为了跳出外层循环
            flg = 0
            break
        y = y + 1
    if flg != 0:
        print(dit[a][value])
    i = i + 1
if flg == 0:
    print("很遗憾答题失败")
else:
    print("恭喜闯关成功！")
